COMP4630.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>COMP4630</title>
<!-- 2017-07-26 Wed 16:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert 'Probie' Offner" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">COMP4630</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Preface</a>
<ul>
<li><a href="#sec-1-1">1.1. <span class="todo TODO">TODO</span> Watch the lecture <code>[66%]</code></a></li>
</ul>
</li>
<li><a href="#sec-2">2. Lecture 1</a>
<ul>
<li><a href="#sec-2-1">2.1. Organisation</a></li>
<li><a href="#sec-2-2">2.2. Example from business process modelling</a></li>
<li><a href="#sec-2-3">2.3. Normal Raj talk</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. <span class="todo TODO">TODO</span> add notes on this <code>[0%]</code></a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Propositional logic</a></li>
<li><a href="#sec-2-5">2.5. First order logic</a></li>
<li><a href="#sec-2-6">2.6. Modal and temporal logic</a></li>
<li><a href="#sec-2-7">2.7. Intuitionistic logic</a></li>
<li><a href="#sec-2-8">2.8. Second order logic</a></li>
<li><a href="#sec-2-9">2.9. Different lecturer warning</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Lecture 2</a>
<ul>
<li><a href="#sec-3-1">3.1. Propositional logic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Watch the lecture <code>[66%]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><code>[X]</code> Watch the lecture
</li>
<li><code>[X]</code> Write notes
</li>
<li><code>[&#xa0;]</code> Find which topics will require work
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Lecture 1</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Organisation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There are 5 assignments, the schedule is on the website.
</p>

<p>
No tutorials, only assignments. Modal and temporal logic is worth
a third of the course <b>assignment are worth more</b>
</p>

<p>
Pls no plagiarism. Copying off someone will destroy their mark
as well
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Example from business process modelling</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The rules are in English in so the bank staff can read them
</p>

<p>
Given a set of NL rules, how do we check consistency and sanity?
</p>

<p>
How do we capture and reason about human reasoning?
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Normal Raj talk</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Syntax + Semantics + Calculus
</p>

<p>
He's nothing if not consistent
</p>

<p>
Schema (statements around meta-variables)
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> add notes on this <code>[0%]</code></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
We want notes for other people to be able to read, so we
probably do need to write about this
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Find out what's confusing for people
</li>
<li><code>[&#xa0;]</code> Write notes on the generic Raj talk
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Propositional logic</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Atomic propositions (can be any sentence)
</p>

<p>
We combine atomic propositions with connectives to
build statements
</p>

<p>
Two main problems - SAT (\(\exists \ model . holds(model)\))  and 
validity (\(\forall model . holds(model)\))
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> First order logic</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Introduces functions and predicates
</p>

<p>
Type theory we'll see at the end is a form of higher order logic
</p>
</div>
</div>


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Modal and temporal logic</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Still a propositional logic
</p>

<p>
Able to say things like \(\phi\) is possibly true, \(\phi\) is necessarily true,
\(\phi\) is true eventually and \(\phi\) is always true.
</p>

<p>
Another Raj-trio talk
</p>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Intuitionistic logic</h3>
<div class="outline-text-3" id="text-2-7">
<p>
It's bae
</p>

<p>
We delete 
</p>
<ul class="org-ul">
<li>\(\phi \lor \lnot \phi\) 
</li>
<li>\(\phi \iff \lnot \lnot \phi\)
</li>
</ul>

<p>
We still have
</p>
<ul class="org-ul">
<li>\(\lnot \phi \iff \lnot \lnot \lnot \phi\)
</li>
</ul>

<p>
Raj-trio talk here
</p>

<p>
But we're only look at the propositional flavour
</p>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Second order logic</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Not studied in the course
</p>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Different lecturer warning</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Different lecturers use different notation
</p>

<p>
Negation: \(\lnot\) \(\sim\) \(\text{!}\)
</p>

<p>
And: \(\land\) \(\text{&}\) \(\sqcap\)
</p>

<p>
Or: \(\lor\) \(\mid\) \(\sqcup\)
</p>

<p>
Implies: \(\rightarrow\) \(\Rightarrow\) \(\supset\)
</p>

<p>
Iff: \(\leftrightarrow\) \(\Leftrightarrow\) \(=\)
</p>

<p>
Turnstile: \(\vdash\) (others omitted due to mathjax issues)
</p>

<p>
We could have a unified notation, but the real world doesn't do that,
so just git gud
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lecture 2</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Propositional logic</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is going to have a lot of repetition from previous courses
</p>

<p>
Which of the follow are true (\(A_1\) is "Socrates is a human", \(A_2\) is "All humans are mortal")
</p>

<ul class="org-ul">
<li><code>[X]</code> \(\{A_1, A_2\} \vdash \text{mortal}(\text{socrates})\)
</li>
<li><code>[&#xa0;]</code> \(\{A_1, A_2\} \vdash \text{mortal}(\text{apollo})\)
</li>
<li><code>[&#xa0;]</code> \(\{A_1, A_2\} \not \vdash \text{mortal}(\text{socrates})\)
</li>
<li><code>[X]</code> \(\{A_1, A_2\} \not \vdash \text{mortal}(\text{apollo})\)
</li>
<li><code>[&#xa0;]</code> \(\{A_1, A_2\} \vdash \lnot \text{mortal}(\text{socrates})\)
</li>
<li><code>[&#xa0;]</code> \(\{A_1, A_2\} \vdash \lnot \text{mortal}(\text{apollo})\)
</li>
</ul>

<p>
Monotonic reasoning is interesting, but not covered
</p>

<p>
SAT solver competitions and theorem proving competitions are fun
</p>

<p>
ATP for mathematical theorems turned out to be infeasible
</p>

<p>
A basic group example from TPTP
</p>

<p>
Proof by refutation is good
</p>

<p>
He's still using beagle (maybe I should merge my congruence closure
stuff back into it?)
</p>

<p>
Current uses are for software verification and proofs of partial
correctness
</p>

<p>
Beagle is not a fast SAT solver (maybe try and fix this?)
</p>

<p>
It can prove a more general thing. (The symmetry rule for n-queens)
</p>

<p>
DPLL is good at providing models - Resolution is bad at getting models
</p>

<p>
Propositional Logic is terminating, complete and fast
</p>

<p>
First order logic is terminating, complete and moderately fast
</p>

<p>
Stamps problem - given 3c and 5c stamps we can make any more greater
than or equal to 8c
</p>

<p>
Beagle doesn't directly handle this
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert 'Probie' Offner</p>
<p class="date">Created: 2017-07-26 Wed 16:20</p>
<p class="creator"></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
